W11D4-JBuilder/TeaTime/app/controllers/api/teas_controller.rb

SELECT "teas".* FROM "teas" WHERE "teas"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def show
        @tea = Tea.find_by(id: params[:id])

SELECT "teas".* FROM "teas"
---
    def index
        @teas = Tea.all

INSERT INTO "teas" ("flavor", "price", "description", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["flavor", "bubble"], ["price", 10.0], ["description", "bubble tea"], ["created_at", "2024-05-16 15:34:03.413476"], ["updated_at", "2024-05-16 15:34:03.413476"]]
---
    def create
        @tea = Tea.new(tea_params)
        if @tea.save