Bluebird/app/controllers/chirps_controller.rb

    def index
        @chirps = Chirp.all # [ChirpInstance1, ChirpInstance2, etc]
---
SELECT "chirps".* FROM "chirps"

    def show
        @chirp = Chirp.find(params[:id])
---
SELECT "chirps".* FROM "chirps" WHERE "chirps"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

    def create
        @chirp = Chirp.new(chirp_params)
        @chirp.author = User.first

        if @chirp.save # save vs. save!
---
SELECT "users".* FROM "users" ORDER BY "users"."id" ASC LIMIT $1  [["LIMIT", 1]]
INSERT INTO "chirps" ("body", "author_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["body", "\"This is our new chirp.\""], ["author_id", 1], ["created_at", "2024-04-10 17:15:15.473897"], ["updated_at", "2024-04-10 17:15:15.473897"]]