Bluebird/app/controllers/users_controller.rb

    def index
        @users = User.all
---
SELECT "users".* FROM "users" ORDER BY "users"."id" ASC

    def create
        @user = User.new(user_params)

        if @user.save
---
INSERT INTO "users" ("username", "email", "created_at", "updated_at", "age", "political_affiliation") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["username", "aminb"], ["email", "aminb@gmail.com"], ["created_at", "2024-04-12 15:36:29.075118"], ["updated_at", "2024-04-12 15:36:29.075118"], ["age", 28], ["political_affiliation", nil]]

    def update
        @user = User.find_by(id: params[:id])

        if @user && @user.update(user_params)
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
UPDATE "users" SET "username" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["username", "catz1"], ["updated_at", "2024-04-12 15:58:29.506480"], ["id", 5]]