w12d2-fullstack-auth/TeaTimeDemo/app/controllers/api/teas_controller.rb

SELECT "teas".* FROM "teas" ORDER BY "teas"."id" ASC LIMIT $1  [["LIMIT", 1]]
---
    def index
        @teas = Tea.all

SELECT "teas".* FROM "teas" WHERE "teas"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def show
        @tea = Tea.find(params[:id])

INSERT INTO "teas" ("flavor", "price", "description", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["flavor", "par"], ["price", 100.0], ["description", nil], ["created_at", "2023-09-08 15:40:27.886551"], ["updated_at", "2023-09-08 15:40:27.886551"]]
---
    def create
        # debugger
        @tea = Tea.new(tea_params)

        if @tea.save