w12d2-fullstack-auth/TeaTimeDemo/app/controllers/api/users_controller.rb

    def create
        @user = User.new(user_params)
        if @user.save
---
INSERT INTO "users" ("username", "created_at", "updated_at", "password_digest", "session_token") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["username", "banana"], ["created_at", "2024-05-21 17:14:34.668063"], ["updated_at", "2024-05-21 17:14:34.668063"], ["password_digest", "[FILTERED]"], ["session_token", "[FILTERED]"]]