w11d5-middleware/demo/TeaTime/app/views/api/teas/show.json.jbuilder

SELECT "users".* FROM "users" WHERE "users"."id" IN ($1, $2, $3)  [["id", 2], ["id", 3], ["id", 4]]
SELECT "transactions".* FROM "transactions" WHERE "transactions"."tea_id" = $1  [["tea_id", 1]]
---

transactions = @tea.transactions.includes(:user)