w12d2-fullstack-auth/TeaTimeDemo/app/models/user.rb

    def generate_unique_session_token
        while true
            token = SecureRandom.urlsafe_base64
            return token unless User.exists?(session_token: token)
---
SELECT 1 AS one FROM "users" WHERE "users"."session_token" = $1 LIMIT $2  [["session_token", "[FILTERED]"], ["LIMIT", 1]]

    def reset_session_token!
        self.session_token = generate_unique_session_token
        self.save!
---
UPDATE "users" SET "updated_at" = $1, "session_token" = $2 WHERE "users"."id" = $3  [["updated_at", "2024-05-21 15:58:07.878577"], ["session_token", "[FILTERED]"], ["id", 1]]