Bluebird/app/models/user.rb

UPDATE "users" SET "updated_at" = $1, "session_token" = $2 WHERE "users"."id" = $3  [["updated_at", "2024-04-16 03:07:10.783288"], ["session_token", "[FILTERED]"], ["id", 12]]
---
    def reset_session_token!
        self.session_token = SecureRandom::urlsafe_base64
        self.save!